# This brewfile installs all of the dependencies required for this dotfile
# configuration. It also installs many useful utilities.
#
# Author: Zach Bedewi

# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

# Necessary Dependencies
brew "zsh"
brew "starship"
brew "coreutils"
brew "neovim"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "tmux"
brew "stow"

# Other useful packages
brew "findutils"
brew "gnu-sed"
brew "wget"
brew "tree"
brew "grep"
brew "ack"
brew "imagemagick"
brew "python"
brew "node"
brew "mas"

# Casks
cask "kitty"
cask "brave-browser"
cask "google-chrome"
cask "1password"
cask "alfred"
cask "spotify"
cask "visual-studio-code"
cask "sublime-text"
cask "skim"

# Fonts
cask "font-fira-code-nerd-font"
